{
  "architectures": [
    "Qwen2TSForCausalLM"
  ],
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_qwen2.Qwen2TSConfig",
    "AutoModel": "modeling_qwen2.Qwen2TSForCausalLM",
    "AutoModelForCausalLM": "modeling_qwen2.Qwen2TSForCausalLM",
    "AutoProcessor": "processing_qwen2_ts.Qwen2TSProcessor"
  },
  "bos_token_id": 151643,
  "eos_token_id": 151645,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "ignore_index": -100,
  "initializer_range": 0.02,
  "intermediate_size": 13824,
  "max_position_embeddings": 32768,
  "max_window_layers": 70,
  "model_type": "qwen2",
  "num_attention_heads": 40,
  "num_hidden_layers": 48,
  "num_key_value_heads": 8,
  "pad_token_id": 151643,
  "rms_norm_eps": 1e-06,
  "rope_theta": 1000000.0,
  "sliding_window": 131072,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.46.2",
  "max_num_channels": 50,
  "ts_loss_weight": 1.0,
  "freeze_model": false,
  "ts": {
    "embedding_dim": 16,
    "hidden_size": 5120,
    "max_length": 32768,
    "max_sequence_length": 32768,
    "num_features": 2,
    "num_layers": 5,
    "patch_size": 8,
    "max_num_channels": 50,
    "use_position_embedding": true,
    "use_position_idx": false
  },
  "ts_token_end_index": 151666,
  "ts_token_start_index": 151665,
  "use_cache": false,
  "use_sliding_window": false,
  "vocab_size": 152064
}