{
  "additional_special_tokens": [
    "<ts>",
    "<ts/>",
    "<ts_index>",
    "<ts_index/>",
    "<ts_trend>",
    "<ts_trend/>"
  ],
  "eos_token": {
    "content": "<|im_end|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  },
  "pad_token": {
    "content": "<|endoftext|>",
    "lstrip": false,
    "normalized": false,
    "rstrip": false,
    "single_word": false
  }
}
